benchmark/go-frameworks/results/20260924-102750/results/post/chi/r3/20000.txt
Running 40s test @ http://10.128.0.4:8082/api/devices
  16 threads and 512 connections
  Thread calibration: mean lat.: 0.925ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.939ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.924ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.120ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.932ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.923ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.909ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.900ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.920ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.908ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.907ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.925ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.928ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.936ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.032ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.933ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.95ms  450.75us  13.38ms   68.80%
    Req/Sec     1.33k   469.72     3.56k    91.37%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.93ms
 75.000%    1.23ms
 90.000%    1.49ms
 99.000%    2.04ms
 99.900%    3.40ms
 99.990%    5.87ms
 99.999%   11.82ms
100.000%   13.39ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.100     0.000000            1         1.00
       0.373     0.100000        59774         1.11
       0.537     0.200000       119372         1.25
       0.680     0.300000       179426         1.43
       0.811     0.400000       239029         1.67
       0.933     0.500000       298791         2.00
       0.992     0.550000       328653         2.22
       1.050     0.600000       358070         2.50
       1.109     0.650000       388020         2.86
       1.169     0.700000       417976         3.33
       1.231     0.750000       447676         4.00
       1.265     0.775000       462705         4.44
       1.301     0.800000       477562         5.00
       1.339     0.825000       492577         5.71
       1.380     0.850000       507499         6.67
       1.430     0.875000       522210         8.00
       1.460     0.887500       529691         8.89
       1.494     0.900000       537159        10.00
       1.530     0.912500       544570        11.43
       1.572     0.925000       552149        13.33
       1.620     0.937500       559617        16.00
       1.646     0.943750       563275        17.78
       1.674     0.950000       566974        20.00
       1.706     0.956250       570714        22.86
       1.743     0.962500       574470        26.67
       1.785     0.968750       578202        32.00
       1.808     0.971875       580044        35.56
       1.835     0.975000       581870        40.00
       1.865     0.978125       583733        45.71
       1.899     0.981250       585628        53.33
       1.938     0.984375       587458        64.00
       1.961     0.985938       588390        71.11
       1.990     0.987500       589332        80.00
       2.019     0.989062       590249        91.43
       2.059     0.990625       591192       106.67
       2.113     0.992188       592127       128.00
       2.145     0.992969       592588       142.22
       2.191     0.993750       593050       160.00
       2.251     0.994531       593513       182.86
       2.343     0.995313       593984       213.33
       2.463     0.996094       594453       256.00
       2.531     0.996484       594682       284.44
       2.615     0.996875       594916       320.00
       2.705     0.997266       595148       365.71
       2.815     0.997656       595379       426.67
       2.947     0.998047       595614       512.00
       3.021     0.998242       595727       568.89
       3.091     0.998437       595845       640.00
       3.177     0.998633       595961       731.43
       3.287     0.998828       596077       853.33
       3.421     0.999023       596194      1024.00
       3.487     0.999121       596252      1137.78
       3.587     0.999219       596310      1280.00
       3.701     0.999316       596370      1462.86
       3.815     0.999414       596428      1706.67
       3.963     0.999512       596485      2048.00
       4.045     0.999561       596514      2275.56
       4.159     0.999609       596543      2560.00
       4.279     0.999658       596573      2925.71
       4.447     0.999707       596602      3413.33
       4.611     0.999756       596631      4096.00
       4.739     0.999780       596646      4551.11
       4.815     0.999805       596660      5120.00
       4.955     0.999829       596675      5851.43
       5.147     0.999854       596689      6826.67
       5.379     0.999878       596704      8192.00
       5.643     0.999890       596711      9102.22
       6.175     0.999902       596718     10240.00
       6.879     0.999915       596726     11702.86
       7.375     0.999927       596733     13653.33
       8.351     0.999939       596740     16384.00
       8.583     0.999945       596744     18204.44
       8.751     0.999951       596747     20480.00
       9.191     0.999957       596751     23405.71
       9.567     0.999963       596755     27306.67
       9.743     0.999969       596758     32768.00
       9.791     0.999973       596761     36408.89
      10.287     0.999976       596762     40960.00
      10.623     0.999979       596764     46811.43
      11.191     0.999982       596766     54613.33
      11.295     0.999985       596767     65536.00
      11.495     0.999986       596768     72817.78
      11.767     0.999988       596769     81920.00
      11.823     0.999989       596770     93622.86
      12.071     0.999991       596771    109226.67
      12.127     0.999992       596772    131072.00
      12.127     0.999993       596772    145635.56
      12.167     0.999994       596773    163840.00
      12.167     0.999995       596773    187245.71
      12.215     0.999995       596774    218453.33
      12.215     0.999996       596774    262144.00
      12.215     0.999997       596774    291271.11
      13.231     0.999997       596775    327680.00
      13.231     0.999997       596775    374491.43
      13.231     0.999998       596775    436906.67
      13.231     0.999998       596775    524288.00
      13.231     0.999998       596775    582542.22
      13.391     0.999998       596776    655360.00
      13.391     1.000000       596776          inf
#[Mean    =        0.945, StdDeviation   =        0.451]
#[Max     =       13.384, Total count    =       596776]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  796346 requests in 40.01s, 131.39MB read
Requests/sec:  19902.67
Transfer/sec:      3.28MB